"Bass Frequency" = "Basfrekvens"; 
"Bass Gain" = "Basförstärkning"; 
"Low Mid Frequency" = "Låg mellanregisterfrekvens";
"Low Mid Gain" = "Låg mellanregisterförstärkning";
"High Mid Frequency" = "Hög mellanregisterfrekvens";
"High Mid Gain" = "Hög mellanregisterförstärkning";
"Treble Frequency" = "Diskantfrekvens";
"Treble Gain" = "Diskantförstärkning";
